{
  "events": [
    {
      "type": "CPW", 
      "name": "The Smash Brothers of Nu Delta", 
      "time": "5:00 PM - 8:00 PM", 
      "dateString": "4/17/15", 
      "location": "Room 4-163", 
      "description": "Join in on the chaos of an all-out 8-player Smash on the big screen with the brothers of Nu Delta! Devour a slice of pizza and quench your thirst with soda after the heat of battle."
    }, 
    {
      "type": "CPW", 
      "name": "ND Lounging", 
      "time": "5:00 PM - 12:00 AM", 
      "dateString": "4/17/15", 
      "location": "460 Beacon Street, Boston", 
      "description": "Want to party tonight? We'll be ready to party hop with you. Or maybe you'd just like to take the night off and relax? Either way, come meet and chill with the brothers of Nu Delta at our house. There will be delicious chicken wings, good music, games, and more to go around!"
    }, 
    {
      "type": "CPW", 
      "name": "Nu Smoothies", 
      "time": "12:00AM - 1:00AM", 
      "dateString": "4/18/15", 
      "location": "460 Beacon Street, Boston", 
      "description": "All partied out tonight? Looking for something to eat? Stop by Nu Delta on your way home to close out the night with snacks and some next level smoothies."
    }, 
    {
      "type": "CPW", 
      "name": "Tex-Mex Breakfast", 
      "time": "9:00 AM - 11:00 AM", 
      "dateString": "4/18/15", 
      "location": "460 Beacon Street, Boston", 
      "description": "Swing by Nu Delta for an amazing Tex-Mex style breakfast with chorizo, omelettes, and breakfast burritos. There will be bacon."
    }, 
    {
      "type": "CPW", 
      "name": "Rock Bed BBQ", 
      "time": "3:00 PM - 5:30 PM", 
      "dateString": "4/18/15", 
      "location": "460 Beacon Street, Boston", 
      "description": "Nothing beats a good burger on a Saturday afternoon on Nu Delta's iconic Phoenix Rock Garden with great music and the brothers of Nu Delta."
    }, 
    {
      "type": "CPW", 
      "name": "The D is for Dance", 
      "time": "10:30 PM - 1:00 AM", 
      "dateString": "4/18/15", 
      "location": "460 Beacon Street, Boston", 
      "description": "Are you ready to get your groove on with the brothers of Nu Delta? Cuz it's Saturday night and we're in the spot. Don't believe me? Just watch. Come dance to your hearts content to nothing but the greatest hits. Oh yeah, we have a dog, too."
    }
  ]
}